[
  {
    "pk": 1,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Do nulla nulla non est pariatur consequat dolor labore nulla ex adipisicing cupidatat. Esse veniam ullamco fugiat ad eu irure sint anim qui pariatur ad. Mollit fugiat laborum laborum aliqua aliqua nostrud tempor excepteur laborum aliquip labore proident et.\n\nEt pariatur ex adipisicing sit sunt minim esse dolore dolore non enim esse. Voluptate cillum mollit aliquip eiusmod. Fugiat eu est labore cupidatat ipsum eu aliquip proident. Reprehenderit occaecat elit dolor sunt nostrud ipsum veniam officia ea laborum.\n\nSint eiusmod elit et proident ex cupidatat nostrud. Labore ipsum amet labore ex pariatur dolor culpa id nostrud. Excepteur mollit do excepteur cupidatat anim ut. Nulla irure in enim magna esse qui ex deserunt. Sunt eiusmod ea sint anim eu. Excepteur duis commodo non ad duis aliqua quis occaecat nostrud eu incididunt anim in laborum."
    }
  },
  {
    "pk": 2,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Labore cillum ex in Lorem cillum consequat duis. Officia do consequat irure proident ipsum mollit cupidatat. Dolore ullamco amet ut sunt occaecat adipisicing commodo sunt ut fugiat excepteur. Non est labore in minim laborum sint magna occaecat.\n\nTempor officia non esse laborum eu labore. Laboris enim in pariatur sit elit reprehenderit. Elit sint veniam non id proident nulla voluptate commodo aute et ad aliqua. Nulla cupidatat eiusmod sunt Lorem irure occaecat. Voluptate non eu sint culpa enim sint. Sit eu officia cillum officia occaecat deserunt ex dolore labore deserunt deserunt labore exercitation. Commodo deserunt dolore ut occaecat aliquip aliquip pariatur tempor.\n\nEst aliquip nostrud excepteur cillum fugiat qui irure non quis consequat labore sunt id sint. Aliqua quis labore eu dolor ullamco pariatur. Anim magna aute ex dolore ex elit dolor cupidatat dolore officia. Anim voluptate pariatur consectetur voluptate. Occaecat in laborum ea pariatur."
    }
  },
  {
    "pk": 3,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Sunt commodo cupidatat occaecat anim aliquip cillum esse anim nostrud eiusmod aliqua labore aute irure. Duis aliqua officia aliqua in nisi eu id id magna cupidatat est. Consectetur non nostrud irure nisi.\n\nCillum duis officia incididunt cillum. Lorem pariatur duis dolor mollit nisi ad. Excepteur Lorem ullamco qui laboris.\n\nPariatur reprehenderit enim ex id occaecat amet ipsum duis incididunt minim. Laboris proident ut consequat ad. Eu anim non occaecat reprehenderit eu non sunt ea consectetur in. Laboris ea in Lorem velit consequat dolore."
    }
  },
  {
    "pk": 4,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Et est est id mollit. Id aute mollit anim occaecat eiusmod ipsum nisi incididunt ea duis ipsum sit esse minim. Elit dolor qui eiusmod officia excepteur aute laborum cupidatat. Nostrud enim cillum non proident veniam eu id exercitation voluptate.\n\nLorem exercitation laborum nisi commodo nostrud quis excepteur laborum. Anim cillum adipisicing et non ullamco fugiat eu ut excepteur nostrud mollit veniam. Laborum ut ullamco exercitation sunt ipsum proident tempor enim ipsum culpa minim ipsum occaecat excepteur. Duis pariatur pariatur magna reprehenderit adipisicing. Ipsum Lorem voluptate cillum dolor occaecat esse occaecat qui commodo Lorem exercitation voluptate Lorem. Cupidatat sit consectetur aliqua in consectetur nulla duis culpa.\n\nReprehenderit incididunt qui cupidatat et labore do Lorem ex voluptate. Nisi quis consequat ad laboris esse ad consectetur. In eu commodo nostrud sint laborum cillum non labore ullamco. Ad qui do enim anim fugiat minim esse cupidatat fugiat Lorem. Minim aliquip excepteur amet adipisicing tempor exercitation ex eu adipisicing officia dolore dolor fugiat. Ullamco ut tempor quis in cupidatat Lorem ullamco consectetur cupidatat commodo aute."
    }
  },
  {
    "pk": 5,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Cupidatat mollit dolor fugiat veniam sit nulla esse cillum Lorem. Amet dolore in eu labore ex esse consectetur nisi Lorem ut irure. Est consequat ea nulla aliquip consectetur sint cillum do adipisicing Lorem in cillum anim. Sunt duis magna consectetur esse incididunt. Est ullamco reprehenderit fugiat excepteur fugiat dolore fugiat adipisicing id ullamco aliqua. Irure laborum labore anim Lorem consectetur proident nisi proident nulla consequat in labore.\n\nNostrud velit sunt est culpa laborum nostrud nostrud occaecat sint dolor in. Non elit duis exercitation veniam. Dolore elit fugiat officia incididunt reprehenderit et incididunt aliqua nisi tempor proident qui laboris qui. Adipisicing incididunt occaecat do eiusmod non ut sint Lorem ad mollit adipisicing.\n\nExcepteur Lorem laborum et proident nulla aute nostrud quis labore aliquip consectetur qui excepteur. Laborum nulla mollit eiusmod excepteur ad laborum esse dolor duis. Id minim ad eiusmod sunt officia aliqua aliqua consectetur aliqua eiusmod dolore pariatur. Do elit consequat minim culpa. Aliqua culpa do reprehenderit cupidatat dolor. Velit cillum qui officia velit ad cupidatat et tempor id qui aute aliquip cupidatat. Excepteur sunt nostrud excepteur ad exercitation sit excepteur deserunt amet ipsum elit nisi."
    }
  },
  {
    "pk": 6,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Aute nostrud minim ea amet eiusmod ex proident Lorem anim aliquip. Deserunt laborum aliquip proident laborum laboris sit laborum elit magna labore veniam et. In consectetur dolor labore esse. Qui nulla laborum fugiat officia sit consectetur amet tempor consequat mollit irure nostrud ea. Occaecat veniam non ipsum exercitation anim sit fugiat sint dolor aliquip non commodo.\n\nConsectetur cupidatat aliquip reprehenderit eu commodo consequat et amet occaecat velit laborum voluptate tempor. Laborum eu nulla et Lorem ad pariatur officia cupidatat. Id id ipsum aliquip est. Fugiat fugiat consectetur dolore laborum incididunt esse pariatur quis aliquip nulla ut fugiat quis nostrud. Aliquip esse officia Lorem commodo est enim. Irure ea qui sint consequat.\n\nElit duis esse voluptate cupidatat. Labore dolor pariatur elit labore labore magna. Consequat sunt sint laboris sint laborum enim eu et officia culpa fugiat eu enim in."
    }
  },
  {
    "pk": 7,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Consequat est incididunt consectetur eu est Lorem cupidatat elit duis est occaecat sint nulla. Occaecat nisi et do est do irure culpa. Ex officia tempor esse voluptate voluptate. Ut enim incididunt magna cupidatat laboris. Ex dolor cillum cupidatat et.\n\nDeserunt aliqua Lorem commodo labore in Lorem aute cupidatat magna. Laboris irure deserunt nisi velit consequat sit commodo eu incididunt tempor. Aliquip aliquip sit do officia id commodo officia pariatur aute eu.\n\nDolor ex sunt laboris voluptate aute eiusmod tempor ullamco et cillum duis adipisicing. Occaecat nostrud est commodo Lorem enim esse deserunt reprehenderit qui velit duis aliquip mollit. Consequat veniam incididunt qui esse adipisicing ea labore dolore aute non pariatur deserunt labore Lorem. Qui enim esse nulla adipisicing deserunt elit. Id eu culpa nostrud ullamco qui reprehenderit officia eu enim sit irure laboris sit ut."
    }
  },
  {
    "pk": 8,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Eu nisi minim et veniam Lorem exercitation irure consequat. Velit consectetur cillum excepteur ex Lorem eiusmod do id sunt esse magna. Deserunt ut dolor quis qui eu sint veniam laborum laborum dolor ut. Incididunt amet consectetur aute occaecat amet officia eiusmod ex qui veniam.\n\nQui esse id anim voluptate mollit ullamco cillum in excepteur est. Officia cupidatat quis deserunt aliqua est voluptate fugiat irure cupidatat incididunt magna dolore occaecat. Aliquip ad deserunt aliquip dolor. Laboris quis eu nostrud dolor fugiat adipisicing velit sint veniam. Magna elit sunt laboris aliquip velit.\n\nConsequat anim irure veniam officia. Dolore consequat dolor ipsum esse do eu adipisicing eiusmod et. Ex aliqua aute mollit et enim aute mollit excepteur pariatur magna reprehenderit nostrud mollit. Duis ex deserunt nostrud sit irure irure Lorem id cillum quis."
    }
  },
  {
    "pk": 9,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Nulla id ea et ullamco tempor Lorem non labore esse. Ut pariatur culpa fugiat enim enim incididunt. Fugiat pariatur nisi quis ut elit.\n\nCommodo labore in aliqua et laboris fugiat duis quis Lorem sunt sunt ipsum mollit sit. Officia magna culpa tempor non Lorem. Adipisicing proident aliqua dolor magna laboris commodo officia cillum magna do occaecat. Est velit Lorem reprehenderit ullamco velit in est culpa ad. Deserunt dolor non minim Lorem pariatur cupidatat Lorem sunt aliqua do fugiat consectetur mollit. Id enim commodo elit enim nisi ad elit aute duis excepteur.\n\nEnim ut dolor quis tempor in commodo. Sunt proident id ullamco quis id sunt labore. Ad qui irure qui veniam magna ipsum cupidatat tempor quis."
    }
  },
  {
    "pk": 10,
    "model": "exemplar_project_proposal.ExemplarProjectProposal",
    "fields": {
      "video": "https://player.vimeo.com/video/12816238",
      "info": "Labore sit magna ipsum mollit ea officia laborum eu laborum ea aliqua proident do ad. Veniam duis cillum sunt excepteur. Amet esse mollit do est. Ipsum magna irure ut excepteur dolore fugiat cillum sunt ullamco culpa veniam nisi commodo nulla.\n\nProident ex ullamco exercitation tempor fugiat esse. Nostrud ea in velit id commodo labore adipisicing sint. Consectetur minim et do enim aute cillum Lorem cupidatat enim sint cillum. Deserunt tempor incididunt voluptate occaecat. In dolor dolor id sit sunt eiusmod excepteur nisi enim cillum tempor magna officia ut. Ad fugiat ea magna fugiat minim ad duis anim cillum ad.\n\nDolore aliquip magna fugiat labore aliqua anim velit fugiat qui incididunt laborum culpa. Labore laborum laborum occaecat excepteur. Lorem anim laborum irure voluptate amet elit ad cupidatat."
    }
  }
]